
# 实用
utility_help = {
    'update_pic': '一些对图片的操作 --> 指令:操作图片/图片/修改图片（包含 10 种图片操作）',
    'search_buff_skin_price': 'BUFF皮肤底价查询 --> 指令:查询皮肤(代理ip不得劲)',
    'weather': '天气查询 --> 指令:xx天气',
    'yiqing': '实时疫情数据 --> 指令:疫情查询/疫情/查询疫情',
    'bt': 'bt(磁力搜索){仅支持私聊，懂的都懂} --> 指令:bt',
    'reimu': '老司机必备！{仅支持私聊，懂的都懂}-> 指令:上车',
    'what_anime': '靠图识番 --> 指令:识番',
    'nonebot_plugin_picsearcher': '以图搜图 --> 指令:识图/这是什么/上一张图是什么',
    'search_anime': '找不到想看的动漫吗？ --> 指令:搜番',
    'songpicker2': '来一首歌听听？ --> 指令:点歌',
    'epic': 'epic速速白嫖 --> 指令:epic',
    'pixiv_r': 'P站排行榜直接冲 --> 指令:p站排行(可含参数)',
    'pixiv_s': 'P站的图随便搜搜 --> 指令:搜图(可含参数)',
    'translate': '出国旅游助手(狗头) --> 指令:英翻/翻英/日翻/翻日/韩翻/翻韩'
}
# 娱乐
entertainment_help = {
    'sign_in': '签到（影响色图几率和开箱次数） --> 指令:签到/我的签到/好感度排行',
    'send_img': '发送图片 --> 指令:美图/萝莉/壁纸',
    'send_setu': '不要小看涩图啊混蛋！ --> 指令:色图/n张色图/n张xx色图/查色图/...（请查看 色图 帮助）',
    'white2black_img': '黑白草图 --> 指令:黑白图/黑白草图',
    'coser': '三次元也不戳 --> 指令:coser',
    'jitang': '不喝点什么不舒服 --> 指令:鸡汤/语录',
    'send_dinggong_voice': '骂我（傲娇？） --> 指令:骂老子',
    'poke': '戳一戳发送语音美图萝莉图不美哉？',
    'open_cases': '模拟开箱（戒赌） --> 指令:开箱(N连开箱[N<=30])/我的开箱/群开箱统计/我的金色',
    'luxun': '鲁迅说过 --> 指令:鲁迅说',
    'fake_msg': '构造一个假消息 --> 指令:假消息',
    'shop_handle': '商店系统(初始送100金币) --> 指令:商店/我的金币/购买道具/使用道具',
    'draw_card_prts': '换个地方当非酋TvT... --> 指令:方舟一井/方舟N抽（0<N<300）',
    'draw_card_genshin': '提瓦特是个好地方！ --> 指令:原神一井/原神N抽（0<N<180）/原神武器/角色N抽/重置原神抽卡次数',
    'draw_card_pretty': '赛马娘！！！！ --> 指令:赛马娘一井/赛马娘N抽/赛马娘卡一井/赛马娘卡N抽(0<N<200)',
    'draw_card_guardian': '坎公骑冠剑.... --> 指令:坎公骑冠剑一井/坎公骑冠剑武器一井/坎公骑冠剑N抽/坎公骑冠剑武器N抽(0<N<300)',
    'draw_card_pcr': '公主连结（国服）来几发 --> 指令:pcr一井/pcrN抽(0<N<300)',
    'draw_card_azur': '我跟方舟坐狱友 --> 指令:碧蓝轻型/重型/特型N抽(0<N<300)',
    'draw_card_fgo': '你就是我的马斯塔嘛 --> 指令:fgoN抽(0<N<300)',
    'draw_card_onmyoji': '普通的阴阳师召唤 --> 指令:阴阳师N抽(0<N<300)',
    'one_friend': '我有一个朋友想问问... --> 指令:我有一个朋友想问问xxx(内容)',
    'nickname': '区区昵称！ --> 指令:以后叫我xx(昵称)/我是谁/取消昵称',
    'almanac': '这是一张正经的黄历 --> 指令:原神黄历',
    'material_remind': '看看原神今天要刷什么 --> 指令:今日素材/天赋材料',
    'qiu_qiu_translation': '这家伙到底在说什么？ --> 指令:丘丘翻译/丘丘一下/丘丘语翻译',
    'query_resource_points': '地图资源速速查看 --> 指令:原神资源查询xx/原神资源列表/哪里有xx/xx在哪(xx=资源名称)',
    'russian': '紧张刺激的俄罗斯轮盘 --> 指令:俄罗斯轮盘帮助',
    'gold_redbag': '运气项目又来啦！ --> 指令:塞红包/ 抢红包指令: 开/抢/戳一戳真寻/ 退回:退回未抢完的红包'
}
# 其他
other_help = [
    '查看当前的群欢迎消息 --> 指令:群欢迎消息',
    '这是一份正经的自我介绍 --> 指令:自我介绍',
    '不得看看自己权力多大？ --> 指令:我的权限',
    '有人记得你是什么时候加入我们的 --> 指令:我的信息',
    '让我看看更新了什么 --> 指令:更新信息',
    '真寻给我把话收回去！ --> 指令:撤回 [id](默认0)',
]
